---
kind: method
id: M:Autodesk.Revit.DB.Structure.StructuralConnectionHandlerType.IsCustom
source: html/ecd5d004-964f-eb6a-c4b2-0916fd8e0b93.htm
---
# Autodesk.Revit.DB.Structure.StructuralConnectionHandlerType.IsCustom Method

Checks if StructuralConnectionHandlerType is custom.

## Syntax (C#)
```csharp
public bool IsCustom()
```

## Returns
True if StructuralConnectionHandlerType is custom.